In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
gdp_df = pd.read_csv('C:/Users/joshc/Documents/NSS/python/projects/un_data-joshcb88/data/gdp_percapita.csv')
gdp_df

     Country or Area  Year        Value  Value Footnotes
0        Afghanistan  2020  1970.560169              NaN
1        Afghanistan  2019  2065.036235              NaN
2        Afghanistan  2018  2033.804389              NaN
3        Afghanistan  2017  2058.400221              NaN
4        Afghanistan  2016  2057.067978              NaN
...              ...   ...          ...              ...
7171        Zimbabwe  1994  2603.927369              NaN
7172        Zimbabwe  1993  2420.092791              NaN
7173        Zimbabwe  1992  2437.152908              NaN
7174        Zimbabwe  1991  2733.696626              NaN
7175        Zimbabwe  1990  2652.129209              NaN

[7176 rows x 4 columns]

How many rows and columns are in `gdp_df`? What are the data types of each column?

In [3]:
gdp_df.shape

(7176, 4)

Drop the `Value Footnotes` column and rename the remaining three to 'Country', 'Year', and 'GDP_Per_Capita'

In [4]:
gdp_df=gdp_df.drop(columns=['Value Footnotes'])
gdp_df.columns
gdp_df.columns=['Country','Year','GD_Per_Capita']
gdp_df

          Country  Year  GD_Per_Capita
0     Afghanistan  2020    1970.560169
1     Afghanistan  2019    2065.036235
2     Afghanistan  2018    2033.804389
3     Afghanistan  2017    2058.400221
4     Afghanistan  2016    2057.067978
...           ...   ...            ...
7171     Zimbabwe  1994    2603.927369
7172     Zimbabwe  1993    2420.092791
7173     Zimbabwe  1992    2437.152908
7174     Zimbabwe  1991    2733.696626
7175     Zimbabwe  1990    2652.129209

[7176 rows x 3 columns]

How many countries have data for all years? Which countries are missing many years of data? Look at the number of observations per year. What do you notice?

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[7176 rows x 0 columns]